; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        ; (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=6, packages=12, locations=13, max_capacity=2, out_folder=training/easy, instance_id=72, seed=113

(define (problem transport-72)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c1)
    (capacity v4 c2)
    (capacity v5 c2)
    (capacity v6 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l7)
    (at p2 l1)
    (at p3 l2)
    (at p4 l5)
    (at p5 l3)
    (at p6 l10)
    (at p7 l5)
    (at p8 l8)
    (at p9 l5)
    (at p10 l5)
    (at p11 l7)
    (at p12 l6)
    (at v1 l7)
    (at v2 l4)
    (at v3 l8)
    (at v4 l7)
    (at v5 l5)
    (at v6 l12)
    (road l3 l7)
    (road l4 l6)
    (road l12 l13)
    (road l11 l2)
    (road l5 l10)
    (road l13 l2)
    (road l2 l11)
    (road l13 l8)
    (road l7 l13)
    (road l3 l9)
    (road l10 l5)
    (road l13 l4)
    (road l13 l7)
    (road l13 l10)
    (road l1 l8)
    (road l6 l4)
    (road l2 l13)
    (road l7 l3)
    (road l4 l13)
    (road l9 l3)
    (road l8 l1)
    (road l10 l13)
    (road l8 l13)
    (road l13 l12)
    (road l4 l9)
    (road l9 l4)
    (road l11 l12)
    (road l12 l11)
    (road l1 l13)
    (road l13 l1)
    (road l4 l5)
    (road l5 l4)
    (road l1 l3)
    (road l3 l1)
    (road l3 l12)
    (road l12 l3)
    (road l6 l11)
    (road l11 l6)
    (road l2 l8)
    (road l8 l2)
    (road l7 l11)
    (road l11 l7)
    (road l2 l10)
    (road l10 l2)
    (road l2 l6)
    (road l6 l2)
    (road l1 l2)
    (road l2 l1)
    (road l3 l6)
    (road l6 l3)
    (road l6 l10)
    (road l10 l6)
    (road l5 l7)
    (road l7 l5)
    (road l2 l3)
    (road l3 l2)
    (road l9 l10)
    (road l10 l9)
    (road l8 l9)
    (road l9 l8)
    (road l5 l6)
    (road l6 l5)
    )
 (:goal  (and 
    (at p1 l1)
    (at p2 l7)
    (at p3 l8)
    (at p4 l8)
    (at p5 l10)
    (at p6 l6)
    (at p7 l10)
    (at p8 l9)
    (at p9 l8)
    (at p10 l3)
    (at p11 l5)
    (at p12 l8))))

; plan
1. (pick-up v1 l7 p1 c0 c1)
   deleted: (at p1 l7) (capacity v1 c1)
   added: (in p1 v1) (capacity v1 c0)
   goals met: 0 of 12
2. (drive v1 l7 l13)
   deleted: (at v1 l7)
   added: (at v1 l13)
   goals met: 0 of 12
3. (drive v1 l13 l1)
   deleted: (at v1 l13)
   added: (at v1 l1)
   goals met: 0 of 12
4. (drop v1 l1 p1 c0 c1)
   deleted: (in p1 v1) (capacity v1 c0)
   added: (at p1 l1) (capacity v1 c1)
   goals met: 1 of 12
5. (pick-up v1 l1 p2 c0 c1)
   deleted: (at p2 l1) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 1 of 12
6. (drive v1 l1 l13)
   deleted: (at v1 l1)
   added: (at v1 l13)
   goals met: 1 of 12
7. (drive v1 l13 l7)
   deleted: (at v1 l13)
   added: (at v1 l7)
   goals met: 1 of 12
8. (drop v1 l7 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l7) (capacity v1 c1)
   goals met: 2 of 12
9. (drive v1 l7 l13)
   deleted: (at v1 l7)
   added: (at v1 l13)
   goals met: 2 of 12
10. (drive v1 l13 l2)
   deleted: (at v1 l13)
   added: (at v1 l2)
   goals met: 2 of 12
11. (pick-up v1 l2 p3 c0 c1)
   deleted: (at p3 l2) (capacity v1 c1)
   added: (in p3 v1) (capacity v1 c0)
   goals met: 2 of 12
12. (drive v1 l2 l8)
   deleted: (at v1 l2)
   added: (at v1 l8)
   goals met: 2 of 12
13. (drop v1 l8 p3 c0 c1)
   deleted: (in p3 v1) (capacity v1 c0)
   added: (at p3 l8) (capacity v1 c1)
   goals met: 3 of 12
14. (drive v1 l8 l13)
   deleted: (at v1 l8)
   added: (at v1 l13)
   goals met: 3 of 12
15. (drive v1 l13 l4)
   deleted: (at v1 l13)
   added: (at v1 l4)
   goals met: 3 of 12
16. (drive v1 l4 l5)
   deleted: (at v1 l4)
   added: (at v1 l5)
   goals met: 3 of 12
17. (pick-up v1 l5 p4 c0 c1)
   deleted: (at p4 l5) (capacity v1 c1)
   added: (in p4 v1) (capacity v1 c0)
   goals met: 3 of 12
18. (drive v1 l5 l10)
   deleted: (at v1 l5)
   added: (at v1 l10)
   goals met: 3 of 12
19. (drive v1 l10 l13)
   deleted: (at v1 l10)
   added: (at v1 l13)
   goals met: 3 of 12
20. (drive v1 l13 l8)
   deleted: (at v1 l13)
   added: (at v1 l8)
   goals met: 3 of 12
21. (drop v1 l8 p4 c0 c1)
   deleted: (in p4 v1) (capacity v1 c0)
   added: (at p4 l8) (capacity v1 c1)
   goals met: 4 of 12
22. (drive v1 l8 l1)
   deleted: (at v1 l8)
   added: (at v1 l1)
   goals met: 4 of 12
23. (drive v1 l1 l3)
   deleted: (at v1 l1)
   added: (at v1 l3)
   goals met: 4 of 12
24. (pick-up v1 l3 p5 c0 c1)
   deleted: (at p5 l3) (capacity v1 c1)
   added: (in p5 v1) (capacity v1 c0)
   goals met: 4 of 12
25. (drive v1 l3 l9)
   deleted: (at v1 l3)
   added: (at v1 l9)
   goals met: 4 of 12
26. (drive v1 l9 l10)
   deleted: (at v1 l9)
   added: (at v1 l10)
   goals met: 4 of 12
27. (drop v1 l10 p5 c0 c1)
   deleted: (in p5 v1) (capacity v1 c0)
   added: (at p5 l10) (capacity v1 c1)
   goals met: 5 of 12
28. (pick-up v1 l10 p6 c0 c1)
   deleted: (at p6 l10) (capacity v1 c1)
   added: (in p6 v1) (capacity v1 c0)
   goals met: 5 of 12
29. (drive v1 l10 l6)
   deleted: (at v1 l10)
   added: (at v1 l6)
   goals met: 5 of 12
30. (drop v1 l6 p6 c0 c1)
   deleted: (in p6 v1) (capacity v1 c0)
   added: (at p6 l6) (capacity v1 c1)
   goals met: 6 of 12
31. (drive v1 l6 l5)
   deleted: (at v1 l6)
   added: (at v1 l5)
   goals met: 6 of 12
32. (pick-up v1 l5 p7 c0 c1)
   deleted: (at p7 l5) (capacity v1 c1)
   added: (in p7 v1) (capacity v1 c0)
   goals met: 6 of 12
33. (drive v1 l5 l10)
   deleted: (at v1 l5)
   added: (at v1 l10)
   goals met: 6 of 12
34. (drop v1 l10 p7 c0 c1)
   deleted: (in p7 v1) (capacity v1 c0)
   added: (at p7 l10) (capacity v1 c1)
   goals met: 7 of 12
35. (drive v1 l10 l13)
   deleted: (at v1 l10)
   added: (at v1 l13)
   goals met: 7 of 12
36. (drive v1 l13 l8)
   deleted: (at v1 l13)
   added: (at v1 l8)
   goals met: 7 of 12
37. (pick-up v1 l8 p8 c0 c1)
   deleted: (at p8 l8) (capacity v1 c1)
   added: (in p8 v1) (capacity v1 c0)
   goals met: 7 of 12
38. (drive v1 l8 l9)
   deleted: (at v1 l8)
   added: (at v1 l9)
   goals met: 7 of 12
39. (drop v1 l9 p8 c0 c1)
   deleted: (in p8 v1) (capacity v1 c0)
   added: (at p8 l9) (capacity v1 c1)
   goals met: 8 of 12
40. (drive v1 l9 l4)
   deleted: (at v1 l9)
   added: (at v1 l4)
   goals met: 8 of 12
41. (drive v1 l4 l5)
   deleted: (at v1 l4)
   added: (at v1 l5)
   goals met: 8 of 12
42. (pick-up v1 l5 p9 c0 c1)
   deleted: (at p9 l5) (capacity v1 c1)
   added: (in p9 v1) (capacity v1 c0)
   goals met: 8 of 12
43. (drive v1 l5 l10)
   deleted: (at v1 l5)
   added: (at v1 l10)
   goals met: 8 of 12
44. (drive v1 l10 l13)
   deleted: (at v1 l10)
   added: (at v1 l13)
   goals met: 8 of 12
45. (drive v1 l13 l8)
   deleted: (at v1 l13)
   added: (at v1 l8)
   goals met: 8 of 12
46. (drop v1 l8 p9 c0 c1)
   deleted: (in p9 v1) (capacity v1 c0)
   added: (at p9 l8) (capacity v1 c1)
   goals met: 9 of 12
47. (drive v1 l8 l13)
   deleted: (at v1 l8)
   added: (at v1 l13)
   goals met: 9 of 12
48. (drive v1 l13 l4)
   deleted: (at v1 l13)
   added: (at v1 l4)
   goals met: 9 of 12
49. (drive v1 l4 l5)
   deleted: (at v1 l4)
   added: (at v1 l5)
   goals met: 9 of 12
50. (pick-up v1 l5 p10 c0 c1)
   deleted: (at p10 l5) (capacity v1 c1)
   added: (in p10 v1) (capacity v1 c0)
   goals met: 9 of 12
51. (drive v1 l5 l7)
   deleted: (at v1 l5)
   added: (at v1 l7)
   goals met: 9 of 12
52. (drive v1 l7 l3)
   deleted: (at v1 l7)
   added: (at v1 l3)
   goals met: 9 of 12
53. (drop v1 l3 p10 c0 c1)
   deleted: (in p10 v1) (capacity v1 c0)
   added: (at p10 l3) (capacity v1 c1)
   goals met: 10 of 12
54. (drive v1 l3 l7)
   deleted: (at v1 l3)
   added: (at v1 l7)
   goals met: 10 of 12
55. (pick-up v1 l7 p11 c0 c1)
   deleted: (at p11 l7) (capacity v1 c1)
   added: (in p11 v1) (capacity v1 c0)
   goals met: 10 of 12
56. (drive v1 l7 l5)
   deleted: (at v1 l7)
   added: (at v1 l5)
   goals met: 10 of 12
57. (drop v1 l5 p11 c0 c1)
   deleted: (in p11 v1) (capacity v1 c0)
   added: (at p11 l5) (capacity v1 c1)
   goals met: 11 of 12
58. (drive v1 l5 l6)
   deleted: (at v1 l5)
   added: (at v1 l6)
   goals met: 11 of 12
59. (pick-up v1 l6 p12 c0 c1)
   deleted: (at p12 l6) (capacity v1 c1)
   added: (in p12 v1) (capacity v1 c0)
   goals met: 11 of 12
60. (drive v1 l6 l2)
   deleted: (at v1 l6)
   added: (at v1 l2)
   goals met: 11 of 12
61. (drive v1 l2 l8)
   deleted: (at v1 l2)
   added: (at v1 l8)
   goals met: 11 of 12
62. (drop v1 l8 p12 c0 c1)
   deleted: (in p12 v1) (capacity v1 c0)
   added: (at p12 l8) (capacity v1 c1)
   goals met: 12 of 12
